profile = {}
profile["name"] = "Kaium"

# 1. Добавьте group, age, pl
# ... ваш код

print(profile)
# {"name": "Kaium", "group": "bc03", "age": 28, "pl": "python"}

# 2. Поменяйте значение по ключу "group" на "bootcamp 03"
# ... ваш код
print(profile)

# 3. Выведите значения по ключам "name" и "pl"
# ... ваш код

# 4. Вывод всех ключей через цикл for
# ... ваш код

# 5. Вывод всех значений
# ... ваш код
for key in profile:
    print(profile[key])
